import React from 'react';
import Card, { CardProps } from './Card/Card';
import styles from '../MyAds.module.scss';

const dataArray: CardProps['data'][] = [
    {
        imageUrl: "https://images.unsplash.com/photo-1597353946119-888dbb405217?q=80&w=870&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
        brand: 'Volkswagen',
        model: 'Touareg',
        price: 71500,
        views: 60,
        phoneViews: 32,
        likes: 0,
        createdAt: 'Вчора о 12:00',
        updatedAt: 'Оновлення',
        description: 'Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там '
    },
    {
        imageUrl: "https://images.unsplash.com/photo-1597353946119-888dbb405217?q=80&w=870&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
        brand: 'Volkswagen',
        model: 'Touareg',
        price: 71500,
        views: 60,
        phoneViews: 32,
        likes: 0,
        createdAt: 'Вчора о 12:00',
        updatedAt: 'Оновлення',
        description: 'Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там Якийсь довгий опис чогось там '
    },
];
export const qntDeactivated = dataArray.length;
const DeactivatedCard: React.FC = () => {

    return (
        <div>
            {dataArray.length > 0 ? (
                dataArray.map((data, index) => (
                    <Card key={index} data={data} />
                ))
            ) : (
                <p className={styles.empty}>На даний момент відсутні деактивовані оголошення</p>
            )}
        </div>
    );
};

export default DeactivatedCard;